Tsung tests/example.xml
<?xml version="1.0" encoding="ISO-8859-1"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="tsung1" weight="1" maxusers="1">
       <ip value="10.248.97.171"></ip>
    </client>

    <client host="tsung2" weight="1" maxusers="1">
       <ip value="10.249.194.240"></ip>
    </client>

    <client host="tsung3" weight="1" maxusers="1">
       <ip value="10.249.114.225"></ip>
    </client>
  </clients>

  <!-- Server side setup -->
<servers>
  <server host="46.137.180.210" port="8080" type="tcp"></server>
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default -->
  <monitoring>
    <monitor host="myserver" type="snmp"></monitor>
  </monitoring>

  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="2" unit="second">
     <users interarrival="0.00125" unit="second"></users>
   </arrivalphase>


  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
 </option>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
   <session name='zompopo' probability='100'  type='ts_http'>
   <request>
     <http url='/webandroid/android' version='1.1'  contents_from_file='/home/ubuntu/.tsung/tsung_recorder20130425-20:29-1.bin' content_type='multipart/form-data; boundary=---------------------------148675415415754762921955381461' method='POST'>
    </http>
   </request>
   </session>

 </sessions>

</tsung>